In [14]:
import pandas as pd
import numpy as np

In [6]:
data={"name":["r1","r2"],"roll_no":[12,13]}

index=["a","b"]

df=pd.DataFrame(data,index)

In [7]:
df.head()

  name  roll_no
a   r1       12
b   r2       13

## 1.Pandas Select Rows by Index (Position/Label)

In [82]:
def dfs():
    technologies = {
        'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
        'Fee' :[20000,25000,26000,22000,24000,21000,22000],
        'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
        'Discount':[1000,2300,1500,1200,2500,2100,2000]
                   }
    index_labels=['r1','r2','r3','r4','r5','r6','r7']
    dfs = pd.DataFrame(technologies,index=index_labels)
    return dfs

print(dfs())

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [83]:
# Select Row by Index
df=dfs()
print(df.iloc[2])

Courses     Hadoop
Fee          26000
Duration    35days
Discount      1500
Name: r3, dtype: object

In [17]:
# Select Rows by Index List
print(df.iloc[[2,3,6]])

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r7    Java  22000   55days      2000

In [18]:
# Select Rows by Integer Index Range
print(df.iloc[1:5])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500

In [20]:
# Select First Row
print(df.iloc[1,:])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [27]:
# Selects alternate rows
print(df.iloc[::2])

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3  Hadoop  26000   35days      1500
r5  pandas  24000      NaN      2500
r7    Java  22000   55days      2000

In [28]:
# Select Row by Index Label
print(df.loc['r2'])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [29]:
# Select Rows by Label Index Range
print(df.loc['r1':'r5'])

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500

## 2.Pandas Select DataFrame Columns by Label or Index

In [33]:
df[['Courses','Fee']]

    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Hadoop  26000
r4   Python  22000
r5   pandas  24000
r6   Oracle  21000
r7     Java  22000

## 3.Pandas Filter Rows using DataFrame.query() Method

In [34]:
"""
Pandas DataFrame.query() method is used to filter the rows based on the expression
(single or multiple column conditions) provided and returns a new DataFrame after 
applying the column filter. In case if you wanted to update the existing referring
DataFrame use inplace=True argument.
"""

'\nPandas DataFrame.query() method is used to filter the rows based on the expression\n(single or multiple column conditions) provided and returns a new DataFrame after \napplying the column filter. In case if you wanted to update the existing referring\nDataFrame use inplace=True argument.\n'

In [45]:
#Not equals, in & multiple conditions
df[(df["Courses"] != 'PySpark') & (df['Fee']>20000)]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r5  pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

In [60]:
df.query("Courses == 'Spark'",inplace=True)
df

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [61]:
# By using lambda function
print(df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])]))

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [63]:
# Select based on value contains
print(df[df['Courses'].str.contains("Spark")])

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [67]:
#Select startswith
df[df['Courses'].str.startswith("S")]

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [68]:
## Pandas – How to Get a Cell Value From DataFrame?

In [86]:
df=dfs()
# print(df.loc[3]['Duration'])
# print(df.loc[3][2])
df.iloc[0,1]

20000

In [92]:
"""Using DataFrame.at[] to select Specific Cell Value by Column Label Name"""
print(df.at[df.index[3],'Duration'])

40days

In [104]:
"""Using DataFrame.iat[] select Specific Cell Value by Column Position"""
print(df.iat[3,2])

40days

## Pandas – Add New Column to Existing DataFrame

In [110]:
df['name']=[i for i in range(0,7)]
df.head(3)

    Courses    Fee Duration  Discount  name
r1    Spark  20000   30days      1000     0
r2  PySpark  25000   40days      2300     1
r3   Hadoop  26000   35days      1500     2

In [124]:
df['discout_percent']=df.apply(lambda x: x.Fee*x.Discount/100,axis=1)
df.head(3)

    Courses    Fee Duration  Discount  name  discout_percent  discout_percen1t
r1    Spark  20000   30days      1000     0         200000.0                 0
r2  PySpark  25000   40days      2300     1         575000.0               100
r3   Hadoop  26000   35days      1500     2         390000.0               200

In [130]:
"""  Adding a New Column at a Specific Position Using """

df.insert(0,'Tutors', df['Duration'])
print(df)

    Tutors  Courses    Fee Duration  Discount  name  discout_percent  \
r1  30days    Spark  20000   30days      1000     0         200000.0
r2  40days  PySpark  25000   40days      2300     1         575000.0
r3  35days   Hadoop  26000   35days      1500     2         390000.0
r4  40days   Python  22000   40days      1200     3         264000.0
r5     NaN   pandas  24000      NaN      2500     4         600000.0
r6    None   Oracle  21000     None      2100     5         441000.0
r7  55days     Java  22000   55days      2000     6         440000.0

    discout_percen1t
r1                 0
r2               100
r3               200
r4               300
r5               400
r6               500
r7               600

## Pandas Rename Columns with Examples

In [131]:
df.columns

Index(['Tutors', 'Courses', 'Fee', 'Duration', 'Discount', 'name',
       'discout_percent', 'discout_percen1t'],
      dtype='object')

In [143]:
df.rename(columns={"Tutorss":"A","digit":"B"},inplace = True)
df.columns

Index(['A', 'Courses', 'Fee', 'Duration', 'Discount', 'B', 'discout_percent',
       'discout_percen1t'],
      dtype='object')

## Pandas Drop Rows From DataFrame Examples

In [144]:
df

,A,Courses,Fee,Duration,Discount,B,discout_percent,discout_percen1t
r1,30days,Spark,20000,30days,1000,0,200000.0,0
r2,40days,PySpark,25000,40days,2300,1,575000.0,100
r3,35days,Hadoop,26000,35days,1500,2,390000.0,200
r4,40days,Python,22000,40days,1200,3,264000.0,300
r5,NaN,pandas,24000,NaN,2500,4,600000.0,400
r6,None,Oracle,21000,None,2100,5,441000.0,500
r7,55days,Java,22000,55days,2000,6,440000.0,600

In [148]:
df.drop(['r1','r2'],axis=0)

,A,Courses,Fee,Duration,Discount,B,discout_percent,discout_percen1t
r3,35days,Hadoop,26000,35days,1500,2,390000.0,200
r4,40days,Python,22000,40days,1200,3,264000.0,300
r5,NaN,pandas,24000,NaN,2500,4,600000.0,400
r6,None,Oracle,21000,None,2100,5,441000.0,500
r7,55days,Java,22000,55days,2000,6,440000.0,600

In [152]:

technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python"],
    'Fee' :[20000,25000,26000,22000],
    'Duration':['30day','40days',np.nan, None],
    'Discount':[1000,2300,1500,1200]
               }

df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000      NaN      1500
3   Python  22000     None      1200

In [156]:
""" drop rows by index"""
df.drop([0,1,2])

  Courses    Fee Duration  Discount
3  Python  22000     None      1200

In [154]:
""" drop column"""

df.drop(['Courses'],axis=1)

     Fee Duration  Discount
0  20000    30day      1000
1  25000   40days      2300
2  26000      NaN      1500
3  22000     None      1200

In [166]:
df.iloc[:,1:2]

     Fee
0  20000
1  25000
2  26000
3  22000

In [175]:
df.drop(df[df['Fee']>25000].index)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
3   Python  22000     None      1200

In [177]:
# Delect rows based on multiple column value
df2 = df[ (df['Fee'] >= 22000) & (df['Discount'] == 2300)]
df2

   Courses    Fee Duration  Discount
1  PySpark  25000   40days      2300

In [180]:
df[df.Discount.notnull()]
# df[df.Discount.isnull()]

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000      NaN      1500
3   Python  22000     None      1200

In [200]:
df=dfs()
print(df[df['Courses'].isin(["Pyspark","Spark"])])
# df

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [201]:
print(df[~df['Courses'].isin(["Python","Spark"])])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [202]:
# Delect rows based on inverse of column values
df1 = df[~(df['Courses'] == "PySpark")].index 
df.drop(df1, inplace = True)
print(df)

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [221]:
df=dfs()
df.drop(df[df['Fee']>20000].index)

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

## Pandas – Change Column Data Type On DataFrame

In [234]:
df.dtypes
"""DataFrame.astype() to Change Data Type in Pandas"""

'DataFrame.astype() to Change Data Type in Pandas'

In [243]:

df['Discount']=df['Discount'].astype(str)
print("before=",df.dtypes)
print("-----------_")
#change one or more column
df=df.astype({"Courses":str,"Fee":int})
print("after",df.dtypes)

before= Courses     object
Fee         object
Duration    object
Discount    object
dtype: object
-----------_
after Courses     object
Fee          int64
Duration    object
Discount    object
dtype: object

## Pandas – Different Ways to Iterate Over Rows in DataFrame

In [251]:
for index,item in df.iterrows():
    print(index,item)

## apply function

In [264]:
df['Fee']=df['Fee'].apply(lambda x : x/1000)

In [265]:
df.head(2)

    Courses   Fee Duration                                           Discount
r1    Spark  20.0   30days  r1    r1    1000\nr2    2300\nr3    1500\nr4  ...
r2  PySpark  25.0   40days  r1    r1    1000\nr2    2300\nr3    1500\nr4  ...

In [266]:
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [289]:
def square_each(a,b):
    return a*a+b*b

df['D']=df.apply(lambda x:square_each(x.A,x.B),axis=1)
df

df['a2']=df['A'].apply(lambda x:np.square(x))
df

   A  B  C   D  a2=  a2
0  3  5  7  34    9   9
1  2  4  6  20    4   4
2  5  8  9  89   25  25

In [290]:
df2 = df.apply(lambda x: np.square(x) if x.name in ['A','B'] else x)
print(df2)

    A   B  C   D  a2=  a2
0   9  25  7  34    9   9
1   4  16  6  20    4   4
2  25  64  9  89   25  25

## Pandas DataFrame groupby() Syntax

In [309]:
import pandas as pd
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [310]:
df.groupby('Courses').sum()

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [311]:
""" groupby on multiple columns """
df.groupby(['Courses','Duration']).sum().reset_index()

   Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

In [313]:
""" 5. Drop NA /None/Nan (on group key) from Group By Result"""
df.groupby(by=['Courses'],dropna=False).sum()

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [321]:
"""# Sorting group keys on descending order"""
df.groupby('Courses',sort=False).sum().sort_values('Courses',ascending=True)

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

## Pandas Shuffle DataFrame Rows Examples

In [322]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30day','40days','35days','40days','60days','50days','55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1500
3   Python  22000   40days      1200
4   pandas  24000   60days      2500
5   Oracle  21000   50days      2100
6     Java  22000   55days      2000

In [331]:
# shuffle the DataFrame rows & return all rows
df1 = df.sample(frac = 1).reset_index(drop=True)
print(df1)

   Courses    Fee Duration  Discount
0   Oracle  21000   50days      2100
1   pandas  24000   60days      2500
2    Spark  20000    30day      1000
3   Hadoop  26000   35days      1500
4  PySpark  25000   40days      2300
5     Java  22000   55days      2000
6   Python  22000   40days      1200

In [355]:
## Using sample() method to shuffle DataFrame rows and columns
df.sample(frac=1,axis=1).sample(frac=1).reset_index(drop=True)

  Duration  Discount    Fee  Courses
0   35days      1500  26000   Hadoop
1   40days      2300  25000  PySpark
2   55days      2000  22000     Java
3   50days      2100  21000   Oracle
4   60days      2500  24000   pandas
5    30day      1000  20000    Spark
6   40days      1200  22000   Python

## Pandas Merge DataFrames

In [356]:
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)

technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [373]:
df1.head()

    Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Python  22000   35days
r4   pandas  30000   50days

In [374]:
df2.head()

   Courses  Discount
r1   Spark      2000
r6    Java      2300
r3  Python      1200
r5      Go      2000

In [378]:
%%time
pd.merge(df1,df2,on='Courses',how='left')
# When column names are different
# method could be inner ,outer,left,right
df3=pd.merge(df1,df2, left_on='Courses', right_on='Courses',how='right')
print(df3)

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days      2000
1    Java      NaN      NaN      2300
2  Python  22000.0   35days      1200
3      Go      NaN      NaN      2000
CPU times: user 10.1 ms, sys: 442 µs, total: 10.5 ms
Wall time: 9.14 ms

## Pandas Concat DataFrames Explained

### Pandas concat vs append vs join vs merge
Concat gives the flexibility to join based on the axis( all rows or all columns) <br>
exm: <br>
    """ append df as row level""" <br>
    df.append(pd.Series(list,index = ["Courses","Fee","Duration","Discount"]),ignore_index=True )

Append is the specific case(axis=0, join='outer') of concat

Join is based on the indexes (set by set_index) on how variable =['left','right','inner','couter']

Merge is based on any particular column each of the two dataframes, this columns are variables on like 'left_on', 'right_on', 'on'

In [407]:
"""
Use pandas.concat() and DataFrame.append() to concat/merge two or multiple 
pandas DataFrames across rows or columns.
"""
"""
Append function will add rows of second data frame to first dataframe iteratively one by one.
Concat function will do a single operation to finish the job, which makes it faster than append().

"""

df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fees': [25000,25200,24500,24900]})


print("-------df----------")
print(df.head(2))
print("-------df2----------")
print(df1.head(2))

-------df----------
   Courses    Fee
0    Spark  20000
1  PySpark  25000
-------df2----------
  Courses   Fees
0  Pandas  25000
1  Hadoop  25200

In [408]:
data=[df,df1]
pd.concat(data)

    Courses      Fee     Fees
0     Spark  20000.0      NaN
1   PySpark  25000.0      NaN
2    Python  22000.0      NaN
3    pandas  24000.0      NaN
0    Pandas      NaN  25000.0
1    Hadoop      NaN  25200.0
2  Hyperion      NaN  24500.0
3      Java      NaN  24900.0

In [409]:
df.append(df1).reset_index(drop=True)

    Courses      Fee     Fees
0     Spark  20000.0      NaN
1   PySpark  25000.0      NaN
2    Python  22000.0      NaN
3    pandas  24000.0      NaN
4    Pandas      NaN  25000.0
5    Hadoop      NaN  25200.0
6  Hyperion      NaN  24500.0
7      Java      NaN  24900.0

## Pandas – Append a List as a Row to DataFrame

In [417]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','35days', '40days','55days'],
    'Discount':[1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   35days      1000
3   Python  24000   40days      1200
4   Pandas  26000   55days      2500

In [426]:
#add list data in df
list = ["Hyperion", 27000, "60days", 2000]
df.loc[len(df)]=list

In [435]:
""" append df as row level"""
print(df.dtypes)
df.append(pd.Series(list,index = ["Courses","Fee","Duration","Discount"]),ignore_index=True )

Courses     object
Fee          int64
Duration    object
Discount     int64
dtype: object

    Courses    Fee Duration  Discount
0     Spark  22000   30days      1000
1   PySpark  25000   50days      2300
2    Hadoop  23000   35days      1000
3    Python  24000   40days      1200
4    Pandas  26000   55days      2500
5  Hyperion  27000   60days      2000
6  Hyperion  27000   60days      2000

In [436]:
df.astype({"Courses":str,"Fee":str})

    Courses    Fee Duration  Discount
0     Spark  22000   30days      1000
1   PySpark  25000   50days      2300
2    Hadoop  23000   35days      1000
3    Python  24000   40days      1200
4    Pandas  26000   55days      2500
5  Hyperion  27000   60days      2000

## Pandas – Replace NaN with Blank/Empty String

In [437]:
"""
By using replace() or fillna() methods you can replace NaN values with Blank/Empty string in Pandas
DataFrame. NaN stands for Not A Number and is one of the common ways to represent the missing data
value in Python/Pandas DataFrame. Sometimes we would be required to convert/replace any missing values 
with the values that make sense like replacing with zero’s for numeric columns and blank or empty for 
string-type columns.
"""

technologies = {
    'Courses':["Spark",np.nan,"Hadoop","Python","pandas",np.nan,"Java"],
    'Fee' :[20000,25000, np.nan,22000,24000,np.nan,22000],
    'Duration':[np.nan,'40days','35days', np.nan,'60days','50days','55days'],
    'Discount':[1000,np.nan,1500,np.nan,2500,2100,np.nan]
              }
df = pd.DataFrame(technologies)
print(df)

  Courses      Fee Duration  Discount
0   Spark  20000.0      NaN    1000.0
1     NaN  25000.0   40days       NaN
2  Hadoop      NaN   35days    1500.0
3  Python  22000.0      NaN       NaN
4  pandas  24000.0   60days    2500.0
5     NaN      NaN   50days    2100.0
6    Java  22000.0   55days       NaN

In [448]:
# df.replace(np.nan,np.mean(df.Discount))
df.replace(np.nan,0)

  Courses      Fee Duration  Discount
0   Spark  20000.0        0    1000.0
1       0  25000.0   40days       0.0
2  Hadoop      0.0   35days    1500.0
3  Python  22000.0        0       0.0
4  pandas  24000.0   60days    2500.0
5       0      0.0   50days    2100.0
6    Java  22000.0   55days       0.0

In [460]:
# df.fillna(np.mean(df.Discount))
df.fillna('********')

    Courses       Fee  Duration  Discount
0     Spark   20000.0  ********    1000.0
1  ********   25000.0    40days  ********
2    Hadoop  ********    35days    1500.0
3    Python   22000.0  ********  ********
4    pandas   24000.0    60days    2500.0
5  ********  ********    50days    2100.0
6      Java   22000.0    55days  ********

## Group By and Get sum() AND count()

In [462]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000],
    'Duration':['30days','50days','55days','40days','60days','35days','55days','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
                })
df = pd.DataFrame(technologies, columns=['Courses','Fee','Duration','Discount'])
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   55days      1000
3   Python  24000   40days      1200
4   Pandas  26000   60days      2500
5   Hadoop  25000   35days      1300
6    Spark  25000   55days      1400
7   Python  22000   50days      1600

In [467]:
#agg function get more than one action 
df.groupby(["Courses","Duration"])['Fee'].agg(["sum","count"]).sort_values('Courses',ascending=True)

                    sum  count
Courses Duration
Hadoop  35days    25000      1
        55days    23000      1
Pandas  60days    26000      1
PySpark 50days    25000      1
Python  40days    24000      1
        50days    22000      1
Spark   30days    22000      1
        55days    25000      1

In [468]:
df2 = df.groupby(['Courses', 'Fee'])['Discount'].transform('sum')
print(df2)

0    1000
1    2300
2    1000
3    1200
4    2500
5    1300
6    1400
7    1600
Name: Discount, dtype: int64

In [477]:
df.groupby(['Courses','Duration'],as_index = False).sum().pivot('Courses','Duration').fillna(0)

              Fee                                              Discount  \
Duration   30days   35days   40days   50days   55days   60days   30days
Courses
Hadoop        0.0  25000.0      0.0      0.0  23000.0      0.0      0.0
Pandas        0.0      0.0      0.0      0.0      0.0  26000.0      0.0
PySpark       0.0      0.0      0.0  25000.0      0.0      0.0      0.0
Python        0.0      0.0  24000.0  22000.0      0.0      0.0      0.0
Spark     22000.0      0.0      0.0      0.0  25000.0      0.0   1000.0


Duration  35days  40days  50days  55days  60days
Courses
Hadoop    1300.0     0.0     0.0  1000.0     0.0
Pandas       0.0     0.0     0.0     0.0  2500.0
PySpark      0.0     0.0  2300.0     0.0     0.0
Python       0.0  1200.0  1600.0     0.0     0.0
Spark        0.0     0.0     0.0  1400.0     0.0

In [478]:
df.isnull().sum()

Courses     0
Fee         0
Duration    0
Discount    0
dtype: int64

## How to Combine Two Series into pandas DataFrame

In [479]:
"""
Using pandas.concat() method you can combine/merge two or more series into a DataFrame
(create DataFrame from multiple series). Besides this you can also use Series.append(),
pandas.merge(), DataFrame.join() to merge multiple Series to create DataFrame.
"""

'\nUsing pandas.concat() method you can combine/merge two or more series into a DataFrame\n(create DataFrame from multiple series). Besides this you can also use Series.append(),\npandas.merge(), DataFrame.join() to merge multiple Series to create DataFrame.\n'

In [480]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

In [482]:
pd.concat([courses,fees,discount],axis=1)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000

In [483]:
# Concat Series by Changing Names
df=pd.concat({'Courses': courses,
              'Course_Fee': fees,
              'Course_Discount': discount},axis=1)
print(df)

   Courses  Course_Fee  Course_Discount
0    Spark       22000             1000
1  PySpark       25000             2300
2   Hadoop       23000             1000

In [493]:
# 2. Combine Two Series Using pandas.merge()
courses=pd.Series(["Spark","PySpark","Hadoop"],name="courses")
fees = pd.Series([22000,25000,23000], name='fees')

pd.merge(courses,fees,right_index=True,left_index=True)

   courses   fees
0    Spark  22000
1  PySpark  25000
2   Hadoop  23000

In [494]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Courses          3 non-null      object
 1   Course_Fee       3 non-null      int64
 2   Course_Discount  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes